Revit 2026 API

# TableSectionDataNumberOfRows Property

---

Gets or sets the number of items in row data array.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public int NumberOfRows { get; set; }
```
```vb
Public Property NumberOfRows As Integer
	Get
	Set
```
```cpp
public:
property int NumberOfRows {
	int get ();
	void set (int value);
}
```
```fsharp
member NumberOfRows : int with get, set
```

#### Property Value

Int32

| Exception | Condition |
| --- | --- |
| InvalidOperationException | When setting this property: This operation is forbidden for cells in standard schedule body sections. |

Note that TableSections may use either 0 or 1 as the first row and column indices. To access the rows and columns:

  * Use FirstRowNumber and LastRowNumber to get the valid range of row indices.
  * Use FirstColumnNumber and LastColumnNumber to get the valid range of column indices.

#### Reference

TableSectionData Class

Autodesk.Revit.DB Namespace